; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v1 - type_3 ?v5 - type_1)
 	      (pred_2 ?v3 - object ?v5 - type_1)
	      (pred_4 ?v1 - type_3 ?v8 - type_2)
	      (pred_3 ?v1 - type_3 ?v3 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v1 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_1 ?v1 ?v7))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_3 ?v6 - object ?v4 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v4) (pred_1 ?v1 ?v4) (pred_4 ?v1 ?v8))
       :effect (and (pred_3 ?v1 ?v6 ?v8)
		    (not (pred_2 ?v6 ?v4)) 
		    (not (pred_4 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_3 ?v6 - object ?v4 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v6 ?v8) (pred_1 ?v1 ?v4))
       :effect (and (pred_2 ?v6 ?v4)
		    (pred_4 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_11 - type_1
obj_14 obj_04 obj_06 obj_12 - type_3
obj_02 obj_13 obj_05 obj_09 - type_2
obj_07 obj_01 obj_03 obj_10 - object)
(:init
(pred_1 obj_08 obj_09)
(pred_4 obj_08 obj_14)
(pred_4 obj_08 obj_04)
(pred_1 obj_11 obj_02)
(pred_4 obj_11 obj_06)
(pred_4 obj_11 obj_12)
(pred_2 obj_07 obj_09)
(pred_2 obj_01 obj_02)
(pred_2 obj_03 obj_09)
(pred_2 obj_10 obj_13)
)
(:goal
(and
(pred_2 obj_07 obj_05)
(pred_2 obj_01 obj_05)
(pred_2 obj_03 obj_09)
(pred_2 obj_10 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_05)))
)
)

; plan
1. (op_1 obj_08 obj_07 obj_09 obj_04)
   deleted: (pred_2 obj_07 obj_09) (pred_4 obj_08 obj_04)
   added: (pred_3 obj_08 obj_07 obj_04)
   goals met: 1 of 4
2. (op_1 obj_11 obj_01 obj_02 obj_12)
   deleted: (pred_2 obj_01 obj_02) (pred_4 obj_11 obj_12)
   added: (pred_3 obj_11 obj_01 obj_12)
   goals met: 1 of 4
3. (op_3 obj_11 obj_02 obj_05)
   deleted: (pred_1 obj_11 obj_02)
   added: (pred_1 obj_11 obj_05)
   goals met: 1 of 4
4. (op_3 obj_08 obj_09 obj_13)
   deleted: (pred_1 obj_08 obj_09)
   added: (pred_1 obj_08 obj_13)
   goals met: 1 of 4
5. (op_2 obj_11 obj_01 obj_05 obj_12)
   deleted: (pred_3 obj_11 obj_01 obj_12)
   added: (pred_2 obj_01 obj_05) (pred_4 obj_11 obj_12)
   goals met: 2 of 4
6. (op_1 obj_08 obj_10 obj_13 obj_14)
   deleted: (pred_2 obj_10 obj_13) (pred_4 obj_08 obj_14)
   added: (pred_3 obj_08 obj_10 obj_14)
   goals met: 2 of 4
7. (op_3 obj_08 obj_13 obj_09)
   deleted: (pred_1 obj_08 obj_13)
   added: (pred_1 obj_08 obj_09)
   goals met: 2 of 4
8. (op_3 obj_11 obj_05 obj_09)
   deleted: (pred_1 obj_11 obj_05)
   added: (pred_1 obj_11 obj_09)
   goals met: 2 of 4
9. (op_2 obj_08 obj_10 obj_09 obj_14)
   deleted: (pred_3 obj_08 obj_10 obj_14)
   added: (pred_2 obj_10 obj_09) (pred_4 obj_08 obj_14)
   goals met: 3 of 4
10. (op_2 obj_08 obj_07 obj_09 obj_04)
   deleted: (pred_3 obj_08 obj_07 obj_04)
   added: (pred_2 obj_07 obj_09) (pred_4 obj_08 obj_04)
   goals met: 3 of 4
11. (op_1 obj_11 obj_07 obj_09 obj_12)
   deleted: (pred_2 obj_07 obj_09) (pred_4 obj_11 obj_12)
   added: (pred_3 obj_11 obj_07 obj_12)
   goals met: 3 of 4
12. (op_3 obj_11 obj_09 obj_05)
   deleted: (pred_1 obj_11 obj_09)
   added: (pred_1 obj_11 obj_05)
   goals met: 3 of 4
13. (op_2 obj_11 obj_07 obj_05 obj_12)
   deleted: (pred_3 obj_11 obj_07 obj_12)
   added: (pred_2 obj_07 obj_05) (pred_4 obj_11 obj_12)
   goals met: 4 of 4
